Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: The value of the expression (which is itself determined within scalar context) is first parsed, and if there weren't any errors, executed in the lexical context of the current Perl program, so that any variable settings or subroutine and format definitions remain afterwards.
es_es: El valor de la expresión (que es en sí mismo determinada en contexto escalar) es primero parseada, y si no hay ningún error, ejecutada en el contexto léxico del actual programa Perl, por lo que no se mantienen después ningún valor de variable o definiciones de subrutinas o formatos.

source: Note that the value is parsed every time the C<eval> executes.
es_es: Note que el valor es parseado cada vez que se ejecuta C<eval>.

source: If EXPR is omitted, evaluates C<$_>.
es_es: Si EXPR se omite, se evalua C<$_>.

source: This form is typically used to delay parsing and subsequent execution of the text of EXPR until run time.
es_es: Esta forma es típicamente usada para retrasar el parseo subsecuente ejecución del texto de EXPR hasta el momento de la ejecución.

source: In the second form, the code within the BLOCK is parsed only once--at the same time the code surrounding the C<eval> itself was parsed--and executed within the context of the current Perl program.
es_es: En la segunda forma, el código dentro del BLOQUE es parseado sólo una vez -al mismo tiempo que el código que rodea al mismo C<eval> es parseado- y ejecutado dentro del contexto del actual programa Perl.

source: This form is typically used to trap exceptions more efficiently than the first (see below), while also providing the benefit of checking the code within BLOCK at compile time.
es_es: Esta forma es típicamente usada para atrapar excepciones más eficientemente que la primera forma (ver arriba), mientras que también provee del beneficio de comprobar el código dentro del BLOQUE en tiempo de compilación.

source: The final semicolon, if any, may be omitted from the value of EXPR or within the BLOCK.
es_es: El último punto y coma, si lo hay, puede ser omitido del valor de EXPR o dentro de BLOQUE.

source: In both forms, the value returned is the value of the last expression evaluated inside the mini-program; a return statement may be also used, just as with subroutines.
es_es: En ambas formas, el valor devuelto es el valor de la última expresión evaluada dentro del mini-programa; una sentencia return se puede usar también, como si fuera una subrutina.

source: The expression providing the return value is evaluated in void, scalar, or list context, depending on the context of the C<eval> itself.
es_es: La expresión que da el valor de retorno es evaluada en contexto vacío (void), escalar o lista, dependiendo del contexto en que se encuentre el C<eval>.

source: See L</wantarray> for more on how the evaluation context can be determined.
es_es: Ver L</wantarray> para saber cómo determinar el contexto de la evaluación.

source: If there is a syntax error or runtime error, or a C<die> statement is executed, an undefined value is returned by C<eval>, and C<$@> is set to the error message.
es_es: Si hay algún error de sintaxis o en tiempo de ejecución, o se ejecuta una sentencia C<die>, un valor indefinido es devuelto por C<eval> y C<$@> es puesto al mensaje de error.

source: If there was no error, C<$@> is guaranteed to be a null string.
es_es: Si no hay errores, se garantiza que C<$@> será un string nulo.

source: Beware that using C<eval> neither silences perl from printing warnings to STDERR, nor does it stuff the text of warning messages into C<$@>.
es_es: Tenga cuidado porque usar C<eval> ni silencia perl a la hora de imprimir avisos al STDERR, ni rellena el texto de los mensajes de error de los mensajes de aviso dentro de C<$@>.

source: To do either of those, you have to use the C<$SIG{__WARN__}> facility, or turn off warnings inside the BLOCK or EXPR using S<C<no warnings 'all'>>.
es_es: Para hacer cualquiera de estas dos cosas debe usar C<$SIG{__WARN__}>, o desactivar los avisos dentro del BLOQUE o EXPR usando S<C<no warnings 'all'>>.

source: See L</warn>, L<perlvar>, L<warnings> and L<perllexwarn>.
es_es: Ver L</warn>, L<perlvar>, L<warnings> y L<perllexwarn>.

source: Note that, because C<eval> traps otherwise-fatal errors, it is useful for determining whether a particular feature (such as C<socket> or C<symlink>) is implemented.
es_es: Note que, como C<eval> atrapa errores considerados fatales, es útil para determinar cuando una característica en particular (como C<socket> o C<symlink>) está implementada.

source: It is also Perl's exception trapping mechanism, where the die operator is used to raise exceptions.
es_es: También es la excepción en el sistema de atrapado de Perl, donde el operador die se usa para levantar excepciones.

source: If the code to be executed doesn't vary, you may use the eval-BLOCK form to trap run-time errors without incurring the penalty of recompiling each time.
es_es: Si el código a ser ejecutado no varía, puede usar la forma BLOQUE de eval para atrapar errores en tiempo de ejecución sin incurrir en la penalidad de recompilar cada vez.

source: The error, if any, is still returned in C<$@>.
es_es: El error, si está, es devuelto en C<$@>.

source: # make divide-by-zero nonfatal
es_es: # hace la división-por-cero no fatal

source: eval { $answer = $a / $b; }; warn $@ if $@;
es_es: eval { $respuesta = $a / $b; }; warn $@ if $@;

source: # same thing, but less efficient
es_es: # lo mismo, pero menos eficiente

source: eval '$answer = $a / $b'; warn $@ if $@;
es_es: eval '$respuesta = $a / $b'; warn $@ if $@;

source: # a compile-time error
es_es: # un error en tiempo de compilación

source: eval { $answer = }; # WRONG
es_es: eval { $respuesta = }; # MAL

source: # a run-time error
es_es: # un error en tiempo de ejecución

source: eval '$answer ='; # sets $@
es_es: eval '$respuesta ='; # pone $@

source: Using the C<eval{}> form as an exception trap in libraries does have some issues.
es_es: Usar la forma C<eval{}> como una trampa de excepciones en bibliotecas puede tener algunos problemas.

source: Due to the current arguably broken state of C<__DIE__> hooks, you may wish not to trigger any C<__DIE__> hooks that user code may have installed.
es_es: Debido al posible mal estado de la llamada C<__DIE__>, quizás deseé no activar ninguna de las llamadas C<__DIE__> que el código de usuario puede haber instalado.

source: You can use the C<local $SIG{__DIE__}> construct for this purpose, as shown in this example:
es_es: Puede usar la construcción C<local $SIG{__DIE__}> para este propósito, como se muestra en este ejemplo:

source: # a very private exception trap for divide-by-zero
es_es: # una muy privada trampa de excepción para la división-por-cero

source: eval { local $SIG{'__DIE__'}; $answer = $a / $b; };
es_es: eval { local $SIG{'__DIE__'}; $respuesta = $a / $b; };

source: This is especially significant, given that C<__DIE__> hooks can call C<die> again, which has the effect of changing their error messages:
es_es: Esto es especialmente significativo, dado que las llamadas C<__DIE__> pueden llamar de nuevo a C<die>, que tiene el ejecto de cambiar los mensajes de error:

source: # __DIE__ hooks may modify error messages
es_es: # llamadas __DIE__ pueden modificar los mensajes de error

source: eval { die "foo lives here" };
es_es: eval { die "foo vive aquí" };

source: print $@ if $@; # prints "bar lives here"
es_es: print $@ if $@; # imprime "bar vive aquí"

source: Because this promotes action at a distance, this counterintuitive behavior may be fixed in a future release.
es_es: Debido a que provoca una acción extraña a gran distancia, este comportamiento no intuitivo puede ser arreglado en una futura distribución.

source: With an C<eval>, you should be especially careful to remember what's being looked at when:
es_es: Dentro de C<eval>, debe, especialmente, recordar que es lo que está haciendo en cada momento:

source: eval $x; # CASE 1
es_es: eval $x; # CASO 1

source: eval "$x"; # CASE 2
es_es: eval "$x"; # CASO 2

source: eval '$x'; # CASE 3
es_es: eval '$x'; # CASO 3

source: eval { $x }; # CASE 4
es_es: eval { $x }; # CASO 4

source: eval "\$$x++"; # CASE 5
es_es: eval "\$$x++"; # CASO 5

source: $$x++; # CASE 6
es_es: $$x++; # CASO 6

source: Cases 1 and 2 above behave identically: they run the code contained in the variable $x.
es_es: Los casos 1 y 2 se comportan idénticamente: ejecutan el código contenido en la variable $x.

source: (Although case 2 has misleading double quotes making the reader wonder what else might be happening (nothing is).) Cases 3 and 4 likewise behave in the same way: they run the code C<'$x'>, which does nothing but return the value of $x.
es_es: (Aunque el caso 2 tiene unas engañosas dobles comillas haciendo maravillar al lector de qué es lo que que puede pasar -que es nada-). Los casos 3 y 4 se comportan de la misma manera: ejecutan el código C<'$x'>, que no hace nada excepto devolver el valor de $x.

source: (Case 4 is preferred for purely visual reasons, but it also has the advantage of compiling at compile-time instead of at run-time.) Case 5 is a place where normally you I<would> like to use double quotes, except that in this particular situation, you can just use symbolic references instead, as in case 6.
es_es: (El caso 4 es el preferido por razones puramente visuales, pero también tiene la ventaja de la compilación en tiempo de compilación en lugar de en tiempo de ejecución). Caso 5 es aquel donde normalmente I<debería> usar dobles comillas, excepto que en esta situación en particular, puede usar en su lugar referencias simbólicas instead, como en el caso 6.

source: C<eval BLOCK> does I<not> count as a loop, so the loop control statements C<next>, C<last>, or C<redo> cannot be used to leave or restart the block.
es_es: C<eval BLOQUE> I<no> cuenta como un bucle, así que las sentencias de control de bucle C<next>, C<last>, o C<redo> no pueden ser usadas para dejar o reiniciar el bloque.

source: Note that as a very special case, an C<eval ''> executed within the C<DB> package doesn't see the usual surrounding lexical scope, but rather the scope of the first non-DB piece of code that called it.
es_es: Note que como caso especial, un C<eval ''> ejecutado dentro del paquete C<DB> no ve el usual ámbito léxico circundante, más bien el ámbito del primer trozo de código no-DB que le llamó.

source: You don't normally need to worry about this unless you are writing a Perl debugger.
es_es: No necesitará preocuparse de esto a menos que esté escribiendo un depurador Perl.

source: =item exec LIST X<exec> X<execute>
es_es: =item exec LISTA X<exec> X<execute> X<ejecutar>

source: =item exec PROGRAM LIST
es_es: =item exec PROGRAMA LISTA

source: The C<exec> function executes a system command I<and never returns>-- use C<system> instead of C<exec> if you want it to return.
es_es: La función C<exec> ejecuta un comando del sistema I<y nunca regresa> --use C<system> en lugar de C<exec> si quiere que regrese.

source: It fails and returns false only if the command does not exist I<and> it is executed directly instead of via your system's command shell (see below).
es_es: Fallará y devolverá falso sólo si el comando no existe I<y> es ejecutado directamente en lugar de hacerlo con el shell de comandos del sistema (ver abajo).

source: Since it's a common mistake to use C<exec> instead of C<system>, Perl warns you if there is a following statement which isn't C<die>, C<warn>, or C<exit> (if C<-w> is set - but you always do that).
es_es: Como es un error normal usar C<exec> en lugar de C<system>, Perl le avisará si hay alguna sentencia a continuación que no sea C<die>, C<warn> o C<exit> (si C<-w> está puesto - pero usted siempre lo tiene así, ¿verdad?).

source: If you I<really> want to follow an C<exec> with some other statement, you can use one of these styles to avoid the warning:
es_es: Si I<verdaderamente> quiere continuar un C<exec> con otra sentencia, puede usar algunas de estas formas para evitar el aviso:

source: exec ('foo') or print STDERR "couldn't exec foo: $!";
es_es: exec ('foo') or print STDERR "no puedo exec foo: $!";

source: { exec ('foo') }; print STDERR "couldn't exec foo: $!";
es_es: { exec ('foo') }; print STDERR "no puedo exec foo: $!";

source: If there is more than one argument in LIST, or if LIST is an array with more than one value, calls execvp(3) with the arguments in LIST.
es_es: Si hay más de un argumento en LISTA, o si LISTA es un array con más de un valor, se llama a execvp(3) con los argumentos de LISTA.

source: If there is only one scalar argument or an array with one element in it, the argument is checked for shell metacharacters, and if there are any, the entire argument is passed to the system's command shell for parsing (this is C</bin/sh -c> on Unix platforms, but varies on other platforms).
es_es: Si sólo hay un argumento escalar o un array con un elemento dentro de él, se comprueba si el argumento tiene metacaracteres, y si hay alguno, el argumento entero es pasado al shell de comandos para que sea parseado (suele ser C</bin/sh -c> en plataformas Unix, pero varía en otras plataformas).

source: If there are no shell metacharacters in the argument, it is split into words and passed directly to C<execvp>, which is more efficient.
es_es: Si no hay metacaracteres shell en el argumento, es dividido en palabras y pasadas directamente a C<execvp>, que es más eficiente.

source: exec '/bin/echo', 'Your arguments are: ', @ARGV;
es_es: exec '/bin/echo', 'Tus argumentos son: ', @ARGV;

source: exec "sort $outfile | uniq";
es_es: exec "sort $salida | uniq";

source: If you don't really want to execute the first argument, but want to lie to the program you are executing about its own name, you can specify the program you actually want to run as an "indirect object" (without a comma) in front of the LIST.
es_es: Si realmente no quiere ejecutar el primer argumento, pero quiere engañar al programa que está ejecutando sobre su propio nombre, puede especificar el programa que quiera ejecutar como un "objeto indirecto" (sin la coma) enfrente de la LISTA.

source: (This always forces interpretation of the LIST as a multivalued list, even if there is only a single scalar in the list.) Example:
es_es: (Esto siempre fuerza la interpretación de la LISTA como una lista multievaluada, incluso si sólo hay un único escalar en la lista). Ejemplo:

source: exec $shell '-sh'; # pretend it's a login shell
es_es: exec $shell '-sh'; # pretende ser un shell del login

source: or, more directly,
es_es: o, más directamente,

source: exec {'/bin/csh'} '-sh'; # pretend it's a login shell
es_es: exec {'/bin/csh'} '-sh'; # pretende ser un shell del login

source: When the arguments get executed via the system shell, results will be subject to its quirks and capabilities.
es_es: Cuando los argumentos son ejecutados vía el shell del sistema, los resultados estarán sujetos a sus peculiaridades y capacidades.

source: See L<perlop/"`STRING`"> for details.
es_es: Ver L<perlop/"`STRING`"> para los detalles.

source: Using an indirect object with C<exec> or C<system> is also more secure.
es_es: Usar un objeto indirecto con C<exec> o C<system> es también más seguro.

source: This usage (which also works fine with system()) forces interpretation of the arguments as a multivalued list, even if the list had just one argument.
es_es: Este uso (que también funciona bien con system()) fuerza la interpretación de los argumentos como una lista multievaluada, incluso si la lista sólo tiene un argumento.

source: That way you're safe from the shell expanding wildcards or splitting up words with whitespace in them.
es_es: De esta forma estará protegido de la expansión de los comodines del shell o de la división en palabras con un espacio en blanco dentro de ellas.

source: @args = ( "echo surprise" );
es_es: @args = ( "echo sorpresa" );

source: exec @args; # subject to shell escapes
es_es: exec @args; # sujeto a los escapes del shell

source: exec { $args[0] } @args; # safe even with one-arg list
es_es: exec { $args[0] } @args; # seguro incluso con una lista de un argumento

source: The first version, the one without the indirect object, ran the I<echo> program, passing it C<"surprise"> an argument.
es_es: La primera versión, sin el objeto indirecto, ejecuta el programa I<echo>, pasándole C<"sorpresa"> como argumento.

source: The second version didn't--it tried to run a program literally called I<"echo surprise">, didn't find it, and set C<$?> to a non-zero value indicating failure.
es_es: La segunda versión no: intentó ejecutar un programa llamado literalmente I<"echo surprise">, no lo encontró, y puso C<$?> a un valor distinto de cero para indicar un fallo.

source: Beginning with v5.6.0, Perl will attempt to flush all files opened for output before the exec, but this may not be supported on some platforms (see L<perlport>).
es_es: A partir de la versión v5.6.0, Perl intentará vaciar todos los ficheros abiertos para salida antes de ejecutar exec, pero esto puede no estar soportado en todas las plataformas (ver L<perlport>).

source: To be safe, you may need to set C<$|> ($AUTOFLUSH in English) or call the C<autoflush()> method of C<IO::Handle> on any open handles in order to avoid lost output.
es_es: Para asegurarse, puede poner C<$|> ($AUTOFLUSH en English) o llamar el método C<autoflush()> de C<IO::Handle> en cualquiera de los manejadores abiertos para evitar la pérdida de datos en la salida.

source: Note that C<exec> will not call your C<END> blocks, nor will it call any C<DESTROY> methods in your objects.
es_es: Note que C<exec> no llamará a sus bloques C<END>, ni llamará a ningún método C<DESTROY> de sus objetos.

source: =item exists EXPR X<exists> X<autovivification>
es_es: =item exists EXPR X<exists> X<autovivificación>

source: Given an expression that specifies a hash element or array element, returns true if the specified element in the hash or array has ever been initialized, even if the corresponding value is undefined.
es_es: Dada una expresión que especifica un elemento de un hash o de un array, devuelve verdadero si el elemento especificado en el hash o array ha sido inicializado, incluso si el correspondiente valor es indefinido.

source: The element is not autovivified if it doesn't exist.
es_es: El elemento no es autovivificado si no existe.

# print "Exists " if exists $hash{$key};
source: print "Exists\n" if exists $hash{$key};
es_es: print "Existe\n" if exists $hash{$clave};

# print "Defined " if defined $hash{$key};
source: print "Defined\n" if defined $hash{$key};
es_es: print "Definido\n" if defined $hash{$clave};

# print "True " if $hash{$key};
source: print "True\n" if $hash{$key};
es_es: print "Verdadero\n" if $hash{$clave};

# print "Exists " if exists $array[$index];
source: print "Exists\n" if exists $array[$index];
es_es: print "Existe\n" if exists $array[$indice];

# print "Defined " if defined $array[$index];
source: print "Defined\n" if defined $array[$index];
es_es: print "Definido\n" if defined $array[$indice];

# print "True " if $array[$index];
source: print "True\n" if $array[$index];
es_es: print "Verdadero\n" if $array[$index];

source: A hash or array element can be true only if it's defined, and defined if it exists, but the reverse doesn't necessarily hold true.
es_es: Un elemento de un hash o de un array puede ser verdadero sólo si está definido, y definido y existe, pero lo inverso no es necesariamente cierto.

source: Given an expression that specifies the name of a subroutine, returns true if the specified subroutine has ever been declared, even if it is undefined.
es_es: Dada una expresión que especifica el nombre de una subrutina, devuelve verdadero si la subrutina especificada ha sido declarada, incluso si esta está indefinida.

source: Mentioning a subroutine name for exists or defined does not count as declaring it.
es_es: Mencionar el nombre de una subrutina para saber si existe o está definida no cuenta como si fuera su declaración.

source: Note that a subroutine which does not exist may still be callable: its package may have an C<AUTOLOAD> method that makes it spring into existence the first time that it is called -- see L<perlsub>.
es_es: Note que una subrutina que no existe puede ser llamada: su paquete puede tener un método C<AUTOLOAD> que la hace aparecer la primera vez que es llamada -- ver L<perlsub>.

# print "Exists " if exists &subroutine;
source: print "Exists\n" if exists &subroutine;
es_es: print "Existe\n" if exists &subrutina;

# print "Defined " if defined &subroutine;
source: print "Defined\n" if defined &subroutine;
es_es: print "Definida\n" if defined &subrutina;

source: Note that the EXPR can be arbitrarily complicated as long as the final operation is a hash or array key lookup or subroutine name:
es_es: Note que EXPR puede ser todo lo arbitrariamente complicada que se quiera con tal de que la operación final sea un escalar de un hash o de un array o el nombre de una subrutina:

source: if (exists $ref->{A}->{B}->{$key}) { }
es_es: if (exists $ref->{A}->{B}->{$clave}) { }

source: if (exists $hash{A}{B}{$key}) { }
es_es: if (exists $hash{A}{B}{$clave}) { }

source: if (exists $ref->{A}->{B}->[$ix]) { }
es_es: if (exists $ref->{A}->{B}->[$indice]) { }

source: if (exists $hash{A}{B}[$ix]) { }
es_es: if (exists $hash{A}{B}[$indice]) { }

source: if (exists &{$ref->{A}{B}{$key}}) { }
es_es: if (exists &{$ref->{A}{B}{$clave}}) { }

source: Although the deepest nested array or hash will not spring into existence just because its existence was tested, any intervening ones will.
es_es: Aunque el array o hash más profundamente anidado no se autovivifique sólo por que su existencia sea comprobada, cualquiera de los niveles intermedios sí lo hará.

source: Thus C<< $ref->{"A"} >> and C<< $ref->{"A"}->{"B"} >> will spring into existence due to the existence test for the $key element above.
es_es: Así. C<< $ref->{"A"} >> y C<< $ref->{"A"}->{"B"} >> aparecerán en la existencia debido al actual test por el elemento $clave.

source: This happens anywhere the arrow operator is used, including even:
es_es: Esto sucede en cualquier parte en que se use el operador flecha, incluso en:

source: if (exists $ref->{"Some key"}) { }
es_es: if (exists $ref->{"Alguna clave"}) { }

source: This surprising autovivification in what does not at first--or even second--glance appear to be an lvalue context may be fixed in a future release.
es_es: Esta sorprendente autovivificación en que al primer vistazo -o incluso al segundo- parece que es un contexto lvalor quizás será arreglado en una futura distribución.

source: See L<perlref/"Pseudo-hashes: Using an array as a hash"> for specifics on how exists() acts when used on a pseudo-hash.
es_es: Ver L<perlref/"Pseudo-hashes: Usando un array como un hash"> para el caso específico de como exists() actua cuando se usa sobre un pseudo-hash.

source: Use of a subroutine call, rather than a subroutine name, as an argument to exists() is an error.
es_es: Usar una llamada de subrutina en lugar del nombre de una subrutina como argumento a exists() es un error.

source: =item exit EXPR X<exit> X<terminate> X<abort>
es_es: =item exit EXPR X<exit> X<terminar> X<abortar>

source: Evaluates EXPR and exits immediately with that value.
es_es: Evalúa EXPR y sale inmediatamente con este valor.

source: See also C<die>.
es_es: Ver también C<die>.

source: If EXPR is omitted, exits with C<0> status.
es_es: Si EXPR es omitida, sale con estado C<0>.
